In [20]:
import pandas as pd

from sklearn.model_selection import train_test_split
from sklearn.naive_bayes import GaussianNB

In [2]:
df = pd.read_csv("titanic_nb.csv")
df.head()

,PassengerId,Name,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,1,"Braund, Mr. Owen Harris",3,male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,"Heikkinen, Miss. Laina",3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,female,35.0,1,0,113803,53.1000,C123,S,1
4,5,"Allen, Mr. William Henry",3,male,35.0,0,0,373450,8.0500,NaN,S,0

In [3]:
df.drop(['PassengerId','Name','SibSp','Parch','Ticket','Cabin','Embarked'],axis='columns',inplace=True)

df.head()

   Pclass     Sex   Age     Fare  Survived
0       3    male  22.0   7.2500         0
1       1  female  38.0  71.2833         1
2       3  female  26.0   7.9250         1
3       1  female  35.0  53.1000         1
4       3    male  35.0   8.0500         0

In [4]:
# create dependent and independent vairables

target = df.Survived
inputs = df.drop('Survived',axis='columns')

In [5]:
dummies = pd.get_dummies(inputs.Sex)
dummies.head()

   female  male
0       0     1
1       1     0
2       1     0
3       1     0
4       0     1

In [6]:
# append the encoded columns into input columns

inputs = pd.concat([inputs,dummies],axis='columns')
inputs.head(5)

   Pclass     Sex   Age     Fare  female  male
0       3    male  22.0   7.2500       0     1
1       1  female  38.0  71.2833       1     0
2       3  female  26.0   7.9250       1     0
3       1  female  35.0  53.1000       1     0
4       3    male  35.0   8.0500       0     1

In [7]:
# drop the text column for the encoded columns

inputs.drop('Sex',axis='columns',inplace=True)
inputs.head()

   Pclass   Age     Fare  female  male
0       3  22.0   7.2500       0     1
1       1  38.0  71.2833       1     0
2       3  26.0   7.9250       1     0
3       1  35.0  53.1000       1     0
4       3  35.0   8.0500       0     1

In [8]:
# check for null values

inputs.columns[inputs.isna().any()]

Index(['Age'], dtype='object')

In [10]:
inputs.Age[:10]

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5     NaN
6    54.0
7     2.0
8    27.0
9    14.0
Name: Age, dtype: float64

In [13]:
# Age has NaN values

inputs.Age = inputs.Age.fillna(inputs.Age.mean())

# check the filled values
inputs.head(6)

   Pclass        Age     Fare  female  male
0       3  22.000000   7.2500       0     1
1       1  38.000000  71.2833       1     0
2       3  26.000000   7.9250       1     0
3       1  35.000000  53.1000       1     0
4       3  35.000000   8.0500       0     1
5       3  29.699118   8.4583       0     1

In [26]:
X_train, X_test, y_train, y_test = train_test_split(inputs, target, test_size=0.2)

In [27]:
len(X_train)

712

In [28]:
len(X_test)

179

In [29]:
len(inputs)

891

In [30]:
# CREATE A NAIVE BAYES MODEL
# we use Gaussian model for when the data is in gaussian form

model = GaussianNB()

In [31]:
model.fit(X_train,y_train)

GaussianNB()

In [32]:
model.score(X_test,y_test)

0.7653631284916201

In [33]:
X_test[:10]

     Pclass        Age     Fare  female  male
566       3  19.000000   7.8958       0     1
153       3  40.500000  14.5000       0     1
479       3   2.000000  12.2875       1     0
837       3  29.699118   8.0500       0     1
736       3  48.000000  34.3750       1     0
873       3  47.000000   9.0000       0     1
244       3  30.000000   7.2250       0     1
413       2  29.699118   0.0000       0     1
110       1  47.000000  52.0000       0     1
883       2  28.000000  10.5000       0     1

In [34]:
y_test[:10]

566    0
153    0
479    1
837    0
736    0
873    0
244    0
413    0
110    0
883    0
Name: Survived, dtype: int64

In [36]:
model.predict(X_test[:10])

array([0, 0, 1, 0, 1, 0, 0, 0, 0, 0], dtype=int64)

In [37]:
# check the probability of survival in format <not survived> , <did survive>
model.predict_proba(X_test[:10])

array([[0.98913279, 0.01086721],
       [0.99138231, 0.00861769],
       [0.0247756 , 0.9752244 ],
       [0.99100523, 0.00899477],
       [0.04531852, 0.95468148],
       [0.9905866 , 0.0094134 ],
       [0.99098142, 0.00901858],
       [0.97895329, 0.02104671],
       [0.88584284, 0.11415716],
       [0.98041241, 0.01958759]])